In [1]:
import pandas as pd

In [2]:
# csv must be in the same folder as the notebook
customers = pd.read_csv('Group7_Assignment2_C1_Part1.csv')

In [3]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2237 entries, 0 to 2236
Data columns (total 23 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ID                   2237 non-null   int64
 1   Year_Birth           2237 non-null   int64
 2   Education            2237 non-null   object
 3   Marital_Status       2237 non-null   object
 4   Income               2237 non-null   float64
 5   Kidhome              2237 non-null   int64
 6   Teenhome             2237 non-null   int64
 7   Dt_Customer          2237 non-null   object
 8   Recency              2237 non-null   int64
 9   MntWines             2237 non-null   int64
 10  MntFruits            2237 non-null   int64
 11  MntMeatProducts      2237 non-null   int64
 12  MntFishProducts      2237 non-null   int64
 13  MntSweetProducts     2237 non-null   int64
 14  MntGoldProds         2237 non-null   int64
 15  NumDealsPurchases    2237 non-null   int64
 16  NumWebPurchases      2237 non-null   int64
 17  NumCatalogPurchases  2237 non-null   int64
 18  NumStorePurchases    2237 non-null   int64
 19  NumWebVisitsMonth    2237 non-null   int64
 20  Complain             2237 non-null   int64
 21  DaysSinceEnrollment  2237 non-null   int64
 22  Generation           2237 non-null   object
dtypes: float64(1), int64(18), object(4)
memory usage: 402.1+ KB

# Question 2
Create a new column named MntProteinProducts with the total amount spent on meat and fish.
*   What is the amount spent on proteins for the ID=4141?

In [4]:
# Creating MntProteinProducts
customers['MntProteinProducts'] = customers['MntMeatProducts'] + customers['MntFishProducts']

In [5]:
# MntProteinProducts amount for ID 4141
customers[customers['ID'] == 4141][['ID', 'MntProteinProducts']]

        ID  MntProteinProducts
1408  4141                 238

In [6]:
protein_4141 = customers[customers['ID'] == 4141]['MntProteinProducts'].iloc[0]

In [7]:
print(f"Amount spent on proteins for ID 4141 = {protein_4141}")

Amount spent on proteins for ID 4141 = 238

# Question 3
Calculate the total amount spent on protein given the marital status, but just for the "BabyBoomers".
*   What is the total amount spent on protein for married baby boomers?

In [8]:
# Selecting married baby boomers
customers_BB_married = customers[(customers['Generation'] == 'BabyBoomer') & (customers['Marital_Status'] == 'Married')]

In [9]:
# MntProteinProducts for married baby boomers
protein_BB_married = customers_BB_married[['MntProteinProducts']].sum().iloc[0]

In [10]:
print(f"Amount spent on proteins for married baby boomers = {protein_BB_married}")

Amount spent on proteins for married baby boomers = 58657

# Question 4
Calculate the average amount spent on sweets, given the generation and the number of kids.
*   What is the average amount spent on sweets for the Millenials with 2 kids?

In [11]:
# avg amount spent on sweets given generation and number of kids
customers_grouped = customers.groupby(['Generation', 'Kidhome'])[['MntProteinProducts']].agg(('mean'))
customers_grouped

                    MntProteinProducts
Generation Kidhome
BabyBoomer 0                276.166090
           1                 50.289157
           2                 35.533333
GenX       0                309.041096
           1                 64.391304
           2                 40.379310
Millenial  0                414.393258
           1                 61.916256
           2                 72.750000
Silent     0                377.125000

In [12]:
# Average MntProteinProducts for millenials with 2 kids
protein_M_2kids = customers[(customers['Generation'] == 'Millenial') & (customers['Kidhome'] == 2)]\
    .groupby(['Generation', 'Kidhome'])['MntProteinProducts'].agg(('mean')).iloc[0]

In [13]:
print(f"Amount spent on proteins for millenials with two kids = {protein_M_2kids}")

Amount spent on proteins for millenials with two kids = 72.75

# Question 5
Calculate the average amount spent on gold, wine, and deals given the income (divided into 10K tranches).
*   What is the average amount spent on wine for those with an income between 90-100K?

In [14]:
# Creating 10k bins
bins_10k = list(range(0,680000, 10000))

In [15]:
# Adding the bins to the dataframe
customers['Income_range'] = pd.cut(customers['Income'], bins_10k)

In [16]:
# Average amount spent on gold and wines, and average number of deals based on income group
customers.groupby('Income_range')[['MntGoldProds','MntWines', 'NumDealsPurchases']].agg('mean')

                  MntGoldProds    MntWines  NumDealsPurchases
Income_range
(0, 10000]           44.172414   16.413793           3.827586
(10000, 20000]       13.051020    7.591837           2.204082
(20000, 30000]       15.341564   15.962963           1.839506
(30000, 40000]       18.200557   46.281337           2.186630
(40000, 50000]       30.795732  152.396341           2.856707
...                        ...         ...                ...
(620000, 630000]           NaN         NaN                NaN
(630000, 640000]           NaN         NaN                NaN
(640000, 650000]           NaN         NaN                NaN
(650000, 660000]           NaN         NaN                NaN
(660000, 670000]     12.000000    9.000000           4.000000

[67 rows x 3 columns]

In [17]:
# Without NaNs
customers.groupby('Income_range')[['MntGoldProds','MntWines', 'NumDealsPurchases']].agg('mean').dropna()

                  MntGoldProds    MntWines  NumDealsPurchases
Income_range
(0, 10000]           44.172414   16.413793           3.827586
(10000, 20000]       13.051020    7.591837           2.204082
(20000, 30000]       15.341564   15.962963           1.839506
(30000, 40000]       18.200557   46.281337           2.186630
(40000, 50000]       30.795732  152.396341           2.856707
(50000, 60000]       49.284884  325.912791           3.316860
(60000, 70000]       65.510574  524.132931           2.598187
(70000, 80000]       76.179310  604.217241           1.613793
(80000, 90000]       72.370370  681.351852           1.111111
(90000, 100000]      59.175000  856.350000           0.625000
(100000, 110000]    145.250000  665.500000           0.250000
(110000, 120000]      3.000000    6.000000           0.000000
(150000, 160000]      2.400000   12.600000           3.000000
(160000, 170000]      3.000000   70.000000           7.500000
(660000, 670000]     12.000000    9.000000           4.000000

In [18]:
# Average amount spent on gold and wines, and average number of deals for the income range of 90k to 100k
customers_income = customers[customers['Income_range'] == pd.Interval(left=90000, right=100000)]
goldwineavg = customers_income[['MntGoldProds', 'MntWines','NumDealsPurchases']].mean()
goldwineavg

MntGoldProds          59.175
MntWines             856.350
NumDealsPurchases      0.625
dtype: float64

In [19]:
print(f"Amount spent on wine for the income group of 90k to 100k = {goldwineavg.iloc[1]}")

Amount spent on wine for the income group of 90k to 100k = 856.35